Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དུ་བར་འཐུལ་ཞིང་མེར་འབར་ཏེ། དཔེར་ན་མེའི་ཕུང་པོ་ཆེན་པོ་བཞིན་ནོ། །ཉི་མ་དང་ཟླ་བ་འདི་དག་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་ལ། འདི་ལྟར་མཐུ་ཆེ་ཞིང་། འདི་ལྟར་དབང་ཆེ་བ་དག་ཀྱང་ལག་པས་བྱུགས་ཤིང་།
en: They can also emit smoke and flames of fire, like a great conflagration, [and release streams of water, like a great raincloud].{Dt.84} However miraculous, powerful, and mighty the sun and the moon might be, they can stroke them with their hands.

source: ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ལུས་ཀྱིས་དབང་སྒྱུར་ཏེ།
en: They can even overwhelm [the god realms], up to and including the Brahmā realms, with their physical bodies.

source: རྫུ་འཕྲུལ་དེས་རློམ་སེམས་སུ་འགྱུར་བ་མེད་དོ།
en: Yet, they do not give rise to conceits on account of such miraculous abilities.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རང་བཞིན་གྱིས་སྟོང་པ་དང་རང་བཞིན་གྱིས་དབེན་པ་དང་།
en: If you ask why, it is because those abilities are essentially empty, essentially void, and essentially nonarising.

source: རང་བཞིན་གྱིས་མ་སྐྱེས་པའི་ཕྱིར། དེས་རྫུ་འཕྲུལ་གང་གིས་རློམ་སེམས་སུ་འགྱུར་པའི་རྫུ་འཕྲུལ་དེ་ལྟ་བུ་མི་དམིགས་ཏེ།
en: The miraculous abilities on the basis of which they might give rise to conceits are nonapprehensible.

source: དེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱ་བ་མ་གཏོགས་པར་རྫུ་འཕྲུལ་ལམ། རྫུ་འཕྲུལ་མངོན་པར་བསྒྲུབ་པའི་བསམ་པ་ཙམ་ཡང་མི་སྐྱེད་དོ།
en: Apart from focusing on all-aspect omniscience, they have not even the slightest wish for miraculous abilities or for manifesting miraculous abilities.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྫུ་འཕྲུལ་གྱི་རྣམ་པ་མངོན་དུ་བྱ་བའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་མངོན་པར་སྒྲུབ་པ་ཡིན་ནོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they will manifest knowledge of the extrasensory power through which the facets of miraculous ability are realized. “

source: །དེ་ལྷའི་རྣ་བའི་ཁམས་རྣམ་པར་དག་པ་མི་ལས་འདས་པས། ལྷ་དང་མི་གཉིས་ཀའི་སྒྲ་ཐོས་ཏེ། ལྷའི་རྣ་བའི་ཁམས་དེས་བདག་ནི་སྒྲ་ཉན་ཅེས་བྱ་བར་རློམ་སེམས་སུ་འགྱུར་བ་མེད་དོ།
en: Since they have the refined sensory element of the ears, indicative of divine clairaudience, which surpasses that of human beings, they can hear the voices of gods and humans, but they do not give rise to conceits on account of that divine clairaudience, thinking, ‘I can hear voices.’

source: །དེ་ནི་འདི་ལྟར་དེས་རང་བཞིན་སྟོང་པ་དང་། རང་བཞིན་དབེན་པ་དང་། རང་བཞིན་མ་སྐྱེས་པའི་ཕྱིར། རྣ་བ་དང་སྒྲ་དམིགས་པ་མེད་དེ།
en: They do not apprehend the sounds that their ears hear because these are essentially empty, essentially void, and essentially nonarising.

source: དེ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱ་བ་མ་གཏོགས་པར་ལྷའི་རྣ་བའི་ཁམས་ལ་བསམ་པ་ཡང་མི་སྐྱེད་དོ།
en: Apart from focusing on all-aspect omniscience, they do not even wish for divine clairaudience.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ལྷའི་རྣ་བའི་ཁམས་མངོན་དུ་བྱ་བའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་མངོན་པར་སྒྲུབ་པ་ཡིན་ནོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་དྲུག་པ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they will manifest knowledge of the extrasensory power through which divine clairaudience is realized. {

source: དེས་སེམས་ཅན་ཕ་རོལ་དང་། གང་ཟག་ཕ་རོལ་གྱི་སེམས་སེམས་ཀྱིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: Dt.85} “They can correctly know with their own minds the minds of other beings and the minds of other persons, exactly as they are.

source: །འདོད་ཆགས་དང་ལྡན་པའི་སེམས་ལ། འདོད་ཆགས་དང་ལྡན་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ལ།
en: That is to say, they correctly know minds that are afflicted with desire as minds that are afflicted with desire, and they correctly know minds free from desire as minds that are free from desire.

source: འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཞེ་སྡང་དང་ལྡན་པའི་སེམས་ལ་ཞེ་སྡང་དང་ལྡན་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཞེ་སྡང་མེད་པའི་སེམས་ལ་ཞེ་སྡང་མེད་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They correctly know minds afflicted with hatred as minds that are afflicted with hatred, and they correctly know minds free from hatred as minds that are free from hatred.

source: །གཏི་མུག་དང་ལྡན་པའི་སེམས་ལ་གཏི་མུག་དང་ལྡན་པའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །གཏི་མུག་དང་བྲལ་བའི་སེམས་ལ་གཏི་མུག་དང་བྲལ་བའི་སེམས་ཤེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They correctly know minds afflicted with delusion as minds that are afflicted with delusion, and they correctly know minds free from delusion as minds that are free from delusion.

source: །སྲེད་པ་དང་ལྡན་པའི་སེམས་ལ་སྲེད་པ་དང་ལྡན་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །སྲེད་པ་དང་བྲལ་བའི་སེམས་ལ་སྲེད་པ་དང་བྲལ་བའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They correctly know minds consumed with craving as minds that are consumed with craving, and they correctly know minds free from craving as minds that are free from craving.

source: །ཉེ་བར་ལེན་པ་དང་བཅས་པའི་སེམས་ལ་ཉེ་བར་ལེན་པ་དང་བཅས་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཉེ་བར་ལེན་པ་མེད་པའི་སེམས་ལ་ཉེ་བར་ལེན་པ་མེད་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They correctly know minds that are possessed by grasping as minds that are possessed by grasping, and they correctly know minds free from grasping as minds that are free from grasping.

source: །ཀུན་ནས་འདུས་པའི་སེམས་ལ་ཀུན་ནས་འདུས་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །རྣམ་པར་འཕྲོས་པའི་སེམས་ལ་རྣམ་པར་འཕྲོས་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They correctly know minds that are composed as minds that are composed, and they correctly know minds that are distracted as minds that are distracted.

source: །རྒྱ་ཆུང་ངུའི་སེམས་ལ་རྒྱ་ཆུང་ངུའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །རྒྱ་ཆེ་བའི་སེམས་ལ་རྒྱ་ཆེ་བའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཡངས་པའི་སེམས་ལ་ཡངས་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They correctly know minds that are small as minds that are small, and they correctly know minds that are great as minds that are great.

source: །དོག་པའི་སེམས་ལ་དོག་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཆེ་བར་གྱུར་པའི་སེམས་ལ་ཆེ་བར་གྱུར་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They correctly know minds that are broad as minds that are broad, and they correctly know minds that are narrow as minds that are narrow.

source: །ཚད་མེད་པའི་སེམས་ལ་ཚད་མེད་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They correctly know minds that are evolving as minds that are evolving, and they correctly know minds that are unlimited as minds that are unlimited.

source: །མཉམ་པར་བཞག་པའི་སེམས་ལ་མཉམ་པར་བཞག་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །མཉམ་པར་མ་བཞག་པའི་སེམས་ལ་མཉམ་པར་མ་བཞག་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They correctly know minds that are in absorption as minds that are in absorption, and they correctly know minds that are not in absorption as minds that are not in absorption.

source: །རྣམ་པར་གྲོལ་བའི་སེམས་ལ་རྣམ་པར་གྲོལ་བའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །རྣམ་པར་མ་གྲོལ་བའི་སེམས་ལ་རྣམ་པར་མ་གྲོལ་བའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཟག་པ་དང་བཅས་པའི་སེམས་ལ་ཟག་པ་དང་བཅས་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They correctly know minds that are liberated as minds that are liberated, and they correctly know minds that are unliberated as minds that are unliberated.

source: །ཟག་པ་མེད་པའི་སེམས་ལ་ཟག་པ་མེད་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They correctly know minds that are contaminated as minds that are contaminated, and they correctly know minds that are uncontaminated as minds that are uncontaminated.

source: །ཉོན་མོངས་པ་དང་བཅས་པའི་སེམས་ལ་ཉོན་མོངས་པ་དང་བཅས་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཉོན་མོངས་པ་མེད་པའི་སེམས་ལ་ཉོན་མོངས་པ་མེད་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: They correctly know minds that are afflicted as minds that are afflicted, and they correctly know minds that are unafflicted as minds that are unafflicted.

source: །བླ་ན་ཡོད་པའི་སེམས་ལ་བླ་ན་ཡོད་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །བླ་ན་མེད་པའི་སེམས་ལ་བླ་ན་མེད་པའི་སེམས་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: They correctly know minds that are surpassed as minds that are surpassed, and they correctly know minds that are unsurpassed as minds that are unsurpassed.

source: གཞན་གྱི་སེམས་ཤེས་པ་དེས་རློམ་སེམས་སུ་འགྱུར་བ་ཡང་མེད་དོ། །དེ་ནི་འདི་ལྟར་སེམས་དེ་ཉིད་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ཏེ།
en: Yet they do not give rise to conceits on account of this knowledge of other minds because the mind itself is inconceivable.

source: དེ་ནི་བདག་གིས་ཤེས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ། །འདི་ལྟར་རང་བཞིན་སྟོང་པ་དང་། རང་བཞིན་དབེན་པ་དང་། རང་བཞིན་མ་སྐྱེས་པའི་ཕྱིར།
en: They do not give rise to the conceit ‘I know,’ because [the mind] is essentially empty, essentially void, and essentially nonarising.

source: གང་གིས་རློམ་སེམས་སུ་འགྱུར་བ་དེ་ལྟ་བུའི་སེམས་མི་དམིགས་ཏེ།
en: They do not apprehend a mind on the basis of which they would give rise to conceits.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱ་བ་མ་གཏོགས་པར་སེམས་ཤེས་པར་བྱ་བའི་བསམ་པའམ། སེམས་ཤེས་པ་མངོན་པར་བསྒྲུབ་པའི་བསམ་པ་ཙམ་ཡང་མི་སྐྱེད་དོ།
en: Apart from focusing on all-aspect omniscience, they do not even wish to know the minds [of others], or even wish to manifest knowledge of the minds [of others].

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་མངོན་དུ་བྱ་བའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་མངོན་པར་སྒྲུབ་པ་ཡིན་ནོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they will manifest knowledge of the extrasensory power through which the minds and conduct of all beings are realized. {

source: །དེ་ནི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་དུ་བྱ་བའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་རྣམ་པ་དུ་མ་མངོན་པར་སྒྲུབ་སྟེ།
en: Dt.86} “They can manifest many facets of the knowledge of the extrasensory power through which recollection of past lives is realized.

source: སེམས་གཅིག་ཀྱང་རྗེས་སུ་དྲན་པ་ནས། སེམས་བརྒྱའི་བར་དུ་ཡང་རྗེས་སུ་དྲན་ནོ། །ཉི་མ་གཅིག་ནས་ཉི་མ་བརྒྱ་དང་།
en: That is to say, they may recollect one thought, or they may recollect anything from that up to a hundred thoughts, or even up to a thousand thoughts.

source: ཟླ་བ་གཅིག་ནས་ཟླ་བ་བརྒྱ་དང་། ལོ་གཅིག་ནས་ལོ་བརྒྱ་དང་། བསྐལ་བ་གཅིག་ནས་བསྐལ་བ་བརྒྱ་དང་། བསྐལ་བ་བརྒྱ་ཕྲག་དུ་མ་ནས་བསྐལ་བ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་རྗེས་སུ་དྲན་ཏེ།
en: They may also recollect anything from one day up to a hundred days, from one month up to a hundred months, from one year up to a hundred years, from one eon up to a hundred eons, from many hundreds of eons up to many thousands of eons and many hundred billion trillions of eons. ‘

source: བདག་ནི་དེ་ལྟ་བུ་ཞིག་ན་འདུག་འདུག་སྟེ།
en: Such was I [in that life].

source: མིང་ནི་འདི་ཞེས་བྱ།
en: Such was my name.

source: རུས་ནི་འདི་ཞེས་བྱ།
en: Such was my family.

source: རིགས་ནི་འདི་ཞེས་བྱ།
en: Such was my social class.

source: ཁ་ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་ཟ།
en: Such was the food I ate.

source: ཡུན་ནི་འདི་སྲིད་ཅིག་ཏུ་འདུག་འདུག །
en: Such was the duration of my life.

source: ཚེའི་མཐའ་ནི་འདི་ཙམ་ཞིག་ཏུ་གྱུར་ཏེ།
en: Such was the extent of my lifespan.

source: དེ་ལྟར་བདག་དེ་ནས་ཤི་འཕོས་ནས། ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་སོ་ཞེས་བྱ་བ་ནས། དེ་ནས་ཤི་འཕོས་ནས་ནི་འདིར་སྐྱེས་སོ་ཞེས་བྱ་བའི་བར་དུ་རྣམ་པ་དང་བཅས།
en: Deceased from there, I was born as so-and-so, and then dying there, I was reborn here!’

source: གཏན་ཚིགས་དང་བཅས། ངན་རྟགས་དང་བཅས་པར་བདག་དང་གཞན་གྱི་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མར་རྗེས་སུ་དྲན་ཏེ།
en: In this way, they can recollect in many details their own past lives and those of others, along with their modes, circumstances, and indications.

source: སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་དུ་བྱ་བའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་དེས་ཀྱང་རློམ་སེམས་སུ་འགྱུར་བ་མེད་དོ། །དེ་ནི་འདི་ལྟར་ཡེ་ཤེས་དེ་ཡེ་ཤེས་མ་ཡིན་ཏེ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར།
en: Yet, they do not give rise to conceits even on account of this knowledge of the extrasensory power through which the recollection of past lives is realized, because that knowledge is not knowledge—it is inconceivable.

source: དེ་ནི་བདག་གིས་རབ་ཏུ་ཤེས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དེ། འདི་ལྟར་དེས་ཡེ་ཤེས་དེ་ཉིད་ཀྱང་རང་བཞིན་སྟོང་པ་དང་། རང་བཞིན་དབེན་པ་དང་། རང་བཞིན་མ་སྐྱེས་པའི་ཕྱིར།
en: They do not give rise to the conceit ‘I know,’ because that knowledge itself is essentially empty, essentially void, and essentially nonarising.

source: གང་གིས་རློམ་སེམས་སུ་འགྱུར་བ་དེ་ལྟ་བུའི་ཡེ་ཤེས་མི་དམིགས་སོ།
en: They do not apprehend any knowledge on the basis of which they would give rise to conceits. {

source: །དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱ་བ་མ་གཏོགས་པར་རྗེས་སུ་དྲན་པའི་ཡེ་ཤེས་ཀྱི་དོན་དུ་བསམ་པ་ཙམ་ཡང་མི་སྐྱེད་དོ།
en: Dt.87} Apart from focusing on all-aspect omniscience, they do not wish in the slightest for the knowledge that recollects [past lives].

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་དུ་བྱ་བའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་མངོན་པར་སྒྲུབ་པ་ཡིན་ནོ། །དེ་ནི་ལྷའི་མིག་རྣམ་པར་དག་པ་མི་ལས་འདས་པས། སེམས་ཅན་འཆི་འཕོ་བ་དང་། སྐྱེ་བ་དང་། ཁ་དོག་སྡུག་པ་དང་།
en: When bodhisattva great beings practice the perfection of wisdom in that manner, Śāradvatīputra, they will manifest knowledge of the extrasensory power through which the recollection of past lives is realized. “

source: ཁ་དོག་མི་སྡུག་པ་དང་། བཟང་བ་དང་། ངན་པ་དང་། ངན་སོང་ན་གནས་པ་དང་། བདེ་འགྲོ་ན་གནས་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་ཏེ།
en: They can know through their pure clairvoyance surpassing [the vision of] humans those beings who are dying, those who are reborn, those who are beautiful, those who are ugly, those who are excellent, those who are inferior, those who dwell in the lower realms, and those who dwell in blissful realms. ‘

source: སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ངན་དུ་སྤྱོད་པ་དང་ལྡན། ངག་གིས་ངན་དུ་སྤྱོད་པ་དང་ལྡན། ཡིད་ཀྱིས་ངན་དུ་སྤྱོད་པ་དང་ལྡན་པ།
en: These beings engage in misconduct with their bodies, these engage in misconduct with their speech, and these engage in misconduct with their minds.

source: འཕགས་པ་རྣམས་ལ་སྐུར་པ་འདེབས་པ་ལོག་པར་ལྟ་བ་རྣམས་ཏེ།
en: They deprecate sublime beings.

source: དེའི་རྒྱུ་དེའི་རྐྱེན་གྱིས་ལུས་ཞིག་ནས་ངན་སོང་དང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བདག་ཏུ་སྐྱེའོ།
en: Due to the causes and conditions of adopting wrong views, when they have died, they will be reborn in inferior realms, falling into the lower abodes, as denizens of the hells!

source: །སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན། ངག་གིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ།
en: These beings engage in noble conduct with their bodies, these engage in noble conduct with their speech, and these engage in noble conduct with their minds.

source: འཕགས་པ་ལ་སྐུར་པ་མི་འདེབས་པ་ཡང་དག་པར་ལྟ་བ་རྣམས་ཏེ།
en: They do not deprecate sublime beings.

source: དེའི་རྒྱུ་དེའི་རྐྱེན་གྱིས་ལུས་ཞིག་ནས། བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: Due to the causes and conditions of adopting correct views, when they have died, they will be reborn within the blissful and exalted realms!’

source: །ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་ཏེ། དེ་ལྟར་ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པ་དག་གི་འགྲོ་བ་དྲུག་ཏུ་གཏོགས་པ་རྣམས་ཀྱི་སྐྱེ་བ་དང་འཆི་འཕོ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: So it is that they correctly know the births and deaths of all those included within the six classes of beings in all world systems of all ten directions within the whole infinity of the realm of phenomena and the very reaches of the realm of space.

source: དེས་ཀྱང་རློམ་སེམས་སུ་འགྱུར་བ་མེད་དོ། །དེ་ནི་འདི་ལྟར་མིག་དེ་མིག་མ་ཡིན་ཞིང་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ཏེ།
en: Yet, they do not give rise to conceits even on that account because this eye is not an eye—it is inconceivable. {

source: དེ་བདག་གིས་མཐོང་ངོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ། །དེ་ཡང་འདི་ལྟར་རང་བཞིན་སྟོང་པ་དང་། རང་བཞིན་དབེན་པ་དང་། རང་བཞིན་མ་སྐྱེས་པའི་ཕྱིར།
en: Dt.88} They do not give rise to the conceit ‘I see,’ because that itself is essentially empty, essentially void, and essentially nonarising.

source: གང་གིས་རློམ་སེམས་སུ་འགྱུར་བའི་མིག་དེ་ལྟ་བུ་དེས་མི་དམིགས་ཏེ།
en: They do not apprehend an eye on the basis of which they would give rise to conceits.

source: དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ་མ་གཏོགས་པར་ལྷའི་མིག་བསམ་པའམ། ལྷའི་མིག་མངོན་པར་བསྒྲུབ་པའི་བསམ་པ་ཙམ་ཡང་མི་སྐྱེད་དོ།
en: Apart from focusing on all-aspect omniscience, they do not wish in the slightest for divine clairvoyance, or wish to manifest divine clairvoyance.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ལྷའི་མིག་མངོན་དུ་བྱ་བའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་མངོན་པར་སྒྲུབ་པ་ཡིན་ནོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they will manifest knowledge of the extrasensory power through which divine clairvoyance is realized. “

source: །དེ་ནི་ཟག་པ་ཟད་པ་མངོན་དུ་བྱ་བའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་མངོན་པར་སྒྲུབ་ཀྱང་། ཉན་ཐོས་ཀྱི་སའམ་རང་སངས་རྒྱས་ཀྱི་ས་ཐོབ་པར་མི་བྱེད་དོ།
en: They manifest knowledge of the extrasensory power through which the cessation of contaminants is realized, and yet they do not acquire the level of the śrāvakas or the level of the pratyekabuddhas.

source: །གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་ཀྱང་གང་ཡང་མི་མཐོང་ངོ་།
en: Nor do they see anything at all through which unsurpassed, complete enlightenment would be attained.

source: །དེ་མངོན་པར་ཤེས་པ་དེས་རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་བྱས་ནས། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་སྤོང་བར་བྱེད་དེ། ཟག་པ་ཟད་པ་མངོན་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་དེས་རློམ་སེམས་སུ་འགྱུར་བ་མེད་དོ། །དེ་ནི་འདི་ལྟར་ཡེ་ཤེས་དེ་ཉིད་ཡེ་ཤེས་མ་ཡིན་ཞིང་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ཏེ།
en: Having attained the vajra-like meditative stability, they abandon all afflictions associated with reincarnation through the continuity of propensities, and yet they do not give rise to conceits on account of that extrasensory power through which the cessation of contaminants is realized, because that knowledge itself is not knowledge—it is inconceivable.

source: དེ་བདག་གིས་རབ་ཏུ་ཤེས་སོ་ཞེས་བྱ་བར་རློམ་སེམས་མེད་དོ། །དེ་ཡང་འདི་ལྟར་རང་བཞིན་སྟོང་པ་དང་། རང་བཞིན་དབེན་པ་དང་།
en: They do not give rise to the conceit ‘I know,’ because that itself is essentially empty, essentially void, and essentially nonarising.

source: རང་བཞིན་མ་སྐྱེས་པའི་ཕྱིར་གང་གིས་རློམ་སེམས་སུ་འགྱུར་བའི་ཟག་པ་ཟད་པའི་ཡེ་ཤེས་མངོན་དུ་བྱ་བའི་མངོན་པར་ཤེས་པ་དེ་ལྟ་བུ་མི་དམིགས་སོ།
en: They do not apprehend any such extrasensory power realizing knowledge of the cessation of contaminants, on the basis of which they would give rise to conceits.

source: །དེ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱ་བ་མ་གཏོགས་པར་ཟག་པ་ཟད་པའི་ཡེ་ཤེས་ཀྱི་བསམ་པའམ། ཟག་པ་ཟད་པ་མངོན་དུ་བྱ་བའི་ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པའི་བསམ་པ་ཙམ་ཡང་མི་སྐྱེད་དོ།
en: Apart from focusing on all-aspect omniscience, they do not wish in the slightest for knowledge of the cessation of contaminants, or wish to manifest knowledge of the cessation of contaminants.

source: །དེ་ལྟར་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཟག་པ་ཟད་པ་མངོན་དུ་བྱ་བ་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པ་ཡིན་ནོ།
en: When bodhisattva great beings practice the perfection of wisdom in that manner, Śāradvatīputra, they will manifest knowledge of the extrasensory power through which the cessation of contaminants is realized. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ཅིང་། མངོན་པར་ཤེས་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱིས་རྣམ་པར་འཕེལ་ལོ།
en: Dt.89} “Śāradvatīputra, bodhisattva great beings who practice the perfection of wisdom in that manner and perfect the six extrasensory powers will flourish through unsurpassed, complete enlightenment. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཆགས་པ་མེད་པའི་སེམས་ཉེ་བར་བཟུང་བས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་སྦྱོང་བ་དག་ཀྱང་ཡོད་དོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they dwell in the perfection of generosity, and also refine the path to all-aspect omniscience, because their minds are unattached, owing to the emptiness of the unlimited.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ལྟུང་བ་བྱ་བ་མེད་པར་ཉེ་བར་བཟུང་བས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་སྦྱོང་བ་དག་ཀྱང་ཡོད་དོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they dwell in the perfection of ethical discipline, and also refine the path to all-aspect omniscience, because they commit no offences, owing to the emptiness of the unlimited.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། མི་འཁྲུག་པ་ཉེ་བར་བཟུང་བས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་སྦྱོང་བ་དག་ཀྱང་ཡོད་དོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they dwell in the perfection of tolerance, and also refine the path to all-aspect omniscience, because they are undisturbed, owing to the emptiness of the unlimited.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་མི་གཞིག་པ་ཉེ་བར་བཟུང་བས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་སྦྱོང་བ་དག་ཀྱང་ཡོད་དོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they dwell in the perfection of perseverance, and also refine the path to all-aspect omniscience, because their physical and mental perseverance is indefatigable, owing to the emptiness of the unlimited.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། འཁྲུག་པ་མེད་པའི་སེམས་ཉེ་བར་བཟུང་བས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་སྦྱོང་བ་དག་ཀྱང་ཡོད་དོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they dwell in the perfection of meditative concentration, and also refine the path to all-aspect omniscience, because their minds are undisturbed, owing to the emptiness of the unlimited.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཤེས་རབ་འཆལ་པའི་སེམས་མི་དམིགས་པ་ཉེ་བར་བཟུང་བས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་སྦྱོང་བ་དག་ཀྱང་ཡོད་དོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom in that manner, they dwell in the perfection of wisdom, and also refine the path to all-aspect omniscience, because they do not apprehend thoughts of stupidity, owing to the emptiness of the unlimited.
